**** Hex computation
 #+index: Table!Calculation
 As with Times computation, the following code allows Computation with
 Hex values in Org-mode tables using the =with-hex= macro.

 Here is the code implementing this macro.
 #+begin_src emacs-lisp
   (defun org-hex-strip-lead (str)
     (if (and (> (length str) 2) (string= (substring str 0 2) "0x"))
         (substring str 2) str))

   (defun org-hex-to-hex (int)
     (format "0x%x" int))

   (defun org-hex-to-dec (str)
     (cond
      ((and (stringp str)
            (string-match "\\([0-9a-f]+\\)" (setf str (org-hex-strip-lead str))))
       (let ((out 0))
         (mapc
          (lambda (ch)
            (setf out (+ (* out 16)
                         (if (and (>= ch 48) (<= ch 57)) (- ch 48) (- ch 87)))))
          (coerce (match-string 1 str) 'list))
         out))
      ((stringp str) (string-to-number str))
      (t str)))

   (defmacro with-hex (hex-output-p &rest exprs)
     "Evaluate an org-table formula, converting all fields that look
       like hexadecimal to decimal integers.  If HEX-OUTPUT-P then
       return the result as a hex value."
     (list
      (if hex-output-p 'org-hex-to-hex 'identity)
      (cons 'progn
            (mapcar
             (lambda (expr)
               `,(cons (car expr)
                       (mapcar (lambda (el)
                                 (if (listp el)
                                     (list 'with-hex nil el)
                                   (org-hex-to-dec el)))
                               (cdr expr))))
             `,@exprs))))
 #+end_src

 Which allows the following forms of table manipulation such as adding
 and subtracting hex values.
 | 0x10 | 0x0 | 0x10 |  16 |
 | 0x20 | 0x1 | 0x21 |  33 |
 | 0x30 | 0x2 | 0x32 |  50 |
 | 0xf0 | 0xf | 0xff | 255 |
 #+TBLFM: $3='(with-hex 'hex (+ $2 $1))::$4='(with-hex nil (identity $3))

**** Use idle timer for automatic agenda views
 #+index: Agenda view!Refresh
 From John Wiegley's mailing list post (March 18, 2010):

 #+begin_quote
 I have the following snippet in my .emacs file, which I find very
 useful. Basically what it does is that if I don't touch my Emacs for 5
 minutes, it displays the current agenda. This keeps my tasks "always
 in mind" whenever I come back to Emacs after doing something else,
 whereas before I had a tendency to forget that it was there.
 #+end_quote

   - [[http://mid.gmane.org/55590EA7-C744-44E5-909F-755F0BBE452D@gmail.com][John Wiegley: Displaying your Org agenda after idle time]]

 #+begin_src emacs-lisp
 (defun jump-to-org-agenda ()
   (interactive)
   (let ((buf (get-buffer "*Org Agenda*"))
         wind)
     (if buf
         (if (setq wind (get-buffer-window buf))
             (select-window wind)
           (if (called-interactively-p)
               (progn
                 (select-window (display-buffer buf t t))
                 (org-fit-window-to-buffer)
                 ;; (org-agenda-redo)
                 )
             (with-selected-window (display-buffer buf)
               (org-fit-window-to-buffer)
               ;; (org-agenda-redo)
               )))
       (call-interactively 'org-agenda-list)))
   ;;(let ((buf (get-buffer "*Calendar*")))
   ;;  (unless (get-buffer-window buf)
   ;;    (org-agenda-goto-calendar)))
   )

 (run-with-idle-timer 300 t 'jump-to-org-agenda)
 #+end_src

 #+results:
 : [nil 0 300 0 t jump-to-org-agenda nil idle]

